log/httpd-100.log
Start web server....
docker run -d --name=web -v `pwd`/data:/usr/local/apache2/htdocs -v `pwd`/dockerfile/httpd/httpd-mpm.conf:/usr/local/apache2/conf/extra/httpd-mpm.conf -p 80:80 httpd
782178e8ad8ede9dee21c96fac658970cafa2793f8dbd5c8fa1456b15f314a49

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=60s -rate 100  | tee results.bin | vegeta report
Requests      [total, rate]            6000, 100.02
Duration      [total, attack, wait]    59.993307s, 59.989999s, 3.308ms
Latencies     [mean, 50, 95, 99, max]  4.232051ms, 4.23ms, 5.854ms, 6.256ms, 15.864ms
Bytes In      [total, mean]            54198000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:6000  
Error Set:

Kill web server....
docker rm -f web
web