log/httpd-200.log
Start web server....
docker run -d --name=web -v `pwd`/data:/usr/local/apache2/htdocs -v `pwd`/dockerfile/httpd/httpd-mpm.conf:/usr/local/apache2/conf/extra/httpd-mpm.conf -p 80:80 httpd
adc53b9a49427b13b7fd64d064ac439facee725600d7f1182d67c615af79f3f4

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=60s -rate 200  | tee results.bin | vegeta report
Requests      [total, rate]            12000, 200.02
Duration      [total, attack, wait]    59.997288s, 59.994999s, 2.289ms
Latencies     [mean, 50, 95, 99, max]  2.984504ms, 2.881ms, 3.956ms, 4.36ms, 12.919ms
Bytes In      [total, mean]            108396000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:12000  
Error Set:

Kill web server....
docker rm -f web
web