log/httpd-300.log
Start web server....
docker run -d --name=web -v `pwd`/data:/usr/local/apache2/htdocs -p 80:80 httpd
94535efd4b9f3b6dcd78c7a5d5945e0f1e8ed70745a7752fb05d01edc194e703

Fire vegeta....
echo "GET http://localhost/index.html" | vegeta attack -duration=60s -rate 300  | tee results.bin | vegeta report
Requests      [total, rate]            18000, 300.02
Duration      [total, attack, wait]    59.998575s, 59.996659667s, 1.915333ms
Latencies     [mean, 50, 95, 99, max]  2.127124ms, 2.077102ms, 2.598697ms, 3.157212ms, 21.472345ms
Bytes In      [total, mean]            216000, 12.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:18000  
Error Set:

Kill web server....
docker rm -f web
web