log/httpd-300.log
Start web server....
docker run -d --name=web -v `pwd`/httpd-log:/usr/local/apache2/logs -p 80:80 peihsinsu/httpd
327115ebdfcc023747ea24ea7559d2a94735612544dd812c511b51a4e4a3fb0a

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=30s -rate 300  | tee results.bin | vegeta report
Requests      [total, rate]            9000, 300.03
Duration      [total, attack, wait]    29.998301s, 29.996662667s, 1.638333ms
Latencies     [mean, 50, 95, 99, max]  1.734763ms, 1.709137ms, 2.281466ms, 2.931014ms, 33.775674ms
Bytes In      [total, mean]            81098274, 9010.92
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  99.76%
Status Codes  [code:count]             0:22  200:8978  
Error Set:
Get http://localhost/pic.png: EOF

Kill web server....
docker rm -f web
web