log/httpd-400.log
Start web server....
docker run -d --name=web -v `pwd`/httpd-log:/usr/local/apache2/logs -p 80:80 peihsinsu/httpd
996e894945b90c23f2b7d5fb0bfd56b2c7cb55d649f8b31ebe04638c38acc32c

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=30s -rate 400  | tee results.bin | vegeta report
Requests      [total, rate]            12000, 400.03
Duration      [total, attack, wait]    29.999082s, 29.997499s, 1.583ms
Latencies     [mean, 50, 95, 99, max]  1.407928ms, 1.492ms, 1.73ms, 2.003ms, 4.22ms
Bytes In      [total, mean]            108396000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:12000  
Error Set:

Kill web server....
docker rm -f web
web