log/httpd-500.log
Start web server....
docker run -d --name=web -v `pwd`/httpd-log:/usr/local/apache2/logs -p 80:80 peihsinsu/httpd
996f66b16a71c8e4dbc39813fc887cd0ca33366ca68caffb79820194786f7f63

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=30s -rate 500  | tee results.bin | vegeta report
Requests      [total, rate]            15000, 500.03
Duration      [total, attack, wait]    29.999016s, 29.997999s, 1.017ms
Latencies     [mean, 50, 95, 99, max]  1.165423ms, 1.113ms, 1.527ms, 2.045ms, 29.052ms
Bytes In      [total, mean]            135495000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:15000  
Error Set:

Kill web server....
docker rm -f web
web