log/nginx-100.log
Start web server....
docker run -d --name=web -v `pwd`/data:/usr/share/nginx/html -v `pwd`/dockerfile/nginx/nginx.conf:/etc/nginx/nginx.conf -p 80:80 nginx 
daadfc94da1f8ed81b331d0f1a71d316e91258c59e2eee576002b34bc22e03cf

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=60s -rate 100  | tee results.bin | vegeta report
Requests      [total, rate]            6000, 100.02
Duration      [total, attack, wait]    59.99394s, 59.989999s, 3.941ms
Latencies     [mean, 50, 95, 99, max]  4.343674ms, 4.409ms, 5.768ms, 6.305ms, 59.141ms
Bytes In      [total, mean]            54198000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:6000  
Error Set:

Kill web server....
docker rm -f web
web