log/nginx-200.log
Start web server....
docker run -d --name=web -v `pwd`/data:/usr/share/nginx/html -p 80:80 nginx 
d75bfc31f1aebba5a5b9a0277b35a32fff84c7fd373df3b4a9cbabc2bbd89f9d

Fire vegeta....
echo "GET http://localhost/index.html" | vegeta attack -duration=60s -rate 200  | tee results.bin | vegeta report
Requests      [total, rate]            12000, 200.02
Duration      [total, attack, wait]    59.997462s, 59.994999s, 2.463ms
Latencies     [mean, 50, 95, 99, max]  2.773289ms, 2.664ms, 3.692ms, 4.132ms, 42.163ms
Bytes In      [total, mean]            144000, 12.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:12000  
Error Set:

Kill web server....
docker rm -f web
web