log/nginx-200.log
Start web server....
docker run -d --name=web -v `pwd`/data:/usr/share/nginx/html -v `pwd`/dockerfile/nginx/nginx.conf:/etc/nginx/nginx.conf -p 80:80 nginx 
fd5af83e0d5d0f58fcb8508893e9637c8eb662e0053c2ac38a00925e23f5703f

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=60s -rate 200  | tee results.bin | vegeta report
Requests      [total, rate]            12000, 200.02
Duration      [total, attack, wait]    59.99746s, 59.994999s, 2.461ms
Latencies     [mean, 50, 95, 99, max]  2.857236ms, 2.753ms, 3.791ms, 4.233ms, 32.445ms
Bytes In      [total, mean]            108396000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:12000  
Error Set:

Kill web server....
docker rm -f web
web