log/nginx-300.log
Start web server....
docker run -d --name=web -v `pwd`/nginx-log:/log -p 80:80 -p 7890:7890 peihsinsu/nginx 
9da8712263845d0420682cf383f4199e5796168acf852b20666834e686280966

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=30s -rate 300  | tee results.bin | vegeta report
Requests      [total, rate]            9000, 300.03
Duration      [total, attack, wait]    29.998389s, 29.996660667s, 1.728333ms
Latencies     [mean, 50, 95, 99, max]  1.504793ms, 1.480873ms, 2.029493ms, 2.568209ms, 55.504667ms
Bytes In      [total, mean]            81297000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:9000  
Error Set:

Kill web server....
docker rm -f web
web