log/nginx-300.log
Start web server....
docker run -d --name=web -v `pwd`/data:/usr/share/nginx/html -p 80:80 nginx 
bde9e3048053c0cbb72725713e241fa5a027a035b04f4a0438465f4ac010bd19

Fire vegeta....
echo "GET http://localhost/index.html" | vegeta attack -duration=60s -rate 300  | tee results.bin | vegeta report
Requests      [total, rate]            18000, 300.02
Duration      [total, attack, wait]    59.998789s, 59.996659667s, 2.129333ms
Latencies     [mean, 50, 95, 99, max]  2.02061ms, 1.980709ms, 2.508112ms, 3.001186ms, 19.705005ms
Bytes In      [total, mean]            216000, 12.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:18000  
Error Set:

Kill web server....
docker rm -f web
web